#### AnalysisDisplayStyleVectorTextType Enumeration

---

|  |
| --- |
| See Also |

Defines text visualization types for vector settings of analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum AnalysisDisplayStyleVectorTextType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalysisDisplayStyleVectorTextType ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalysisDisplayStyleVectorTextType ``` |

# Members

| Member name | Description |
| --- | --- |
| ShowAll | Show vector text label for each point |
| ShowNone | Don't show vector text labels |
| ShowPredefined | Show vector text label only for points that have flag ValueAtPointFlags::DisplayText |

# See Also

Autodesk.Revit.DB.Analysis Namespace